/****************************************************************************

                            Driver.h

     Driver specfic UIOT structures and adjunct to the network node

*****************************************************************************/



#ifndef __DRIVER_H__
#define __DRIVER_H__

#define VENDOR_ID	0x144A
#define DEVICE_ID	0x8164
#define SUB_ID		0x8164  
#define BAR_ADDR_TO_READ 0x1  
#define BAR_ADDR_TO_READ2 0x2  
#define TASKNAME	"PCI8164"

#define DriverID       0x14538164L



#define DriverVERS          0x00030009L
#define NETCONFIG_ID        0x00030009L
#define NETCONFIG_VERS      0x00030009L
#define DEVCONFIG_VERS      0x00030009L     



#define DEVCONFIG_ID        0x12345678L    
#define RT3_SENTINEL        0x55667788L


// max Num of networks can be controlled by 1 PC
#define  MAX_DRV_INSTANCES          12      


#include  "errors.h"

#ifndef APSTUDIO_READONLY_SYMBOLS


#ifndef VLCPORT_H__
#include "vlcport.h"
#pragma warning( disable: 4244 )
#endif

#ifndef DATASEG_H__
#include "dataseg.h"
#endif



//************   1 byte alignment typedef structures !!!   ************

#pragma BYTE_ALIGN(_SPECIAL_INST)
typedef struct _SPECIAL_INST*  LPSPECIAL_INST_;
typedef UINT8*  LPUINT8;


typedef  selector   SEMAPHORE;

typedef  UINT32     UIOTREF2CHAR;
typedef  UINT32     UIOTREF2SINT8;
typedef  UINT32     UIOTREF2UINT8;
typedef  UINT32     UIOTREF2SINT16;
typedef  UINT32     UIOTREF2UINT16;
typedef  UINT32     UIOTREF2SINT32;
typedef  UINT32     UIOTREF2UINT32;
typedef  UINT32     UIOTREF2DOUBLE;
typedef  UINT32     UIOTREF2VOID;


#pragma BYTE_ALIGN(_LINKED_LIST)
typedef struct _LINKED_LIST 
{
    LPSPECIAL_INST_     pHead;      
    LPSPECIAL_INST_     pTail;      
    SEMAPHORE           Semaphore;  
    UINT16              uCounter;   
} LINKED_LIST, *LPLINKED_LIST; 
#pragma BYTE_NORMAL()


#pragma BYTE_ALIGN(_PTBUFFER)
typedef struct _PTBUFFER 
{
    UIOTREF2VOID    Offset;  
    UINT32          Size;           
} PTBUFFER, * LPPTBUFFER;           
#pragma BYTE_NORMAL()


#pragma BYTE_ALIGN(_TASK)
typedef struct _TASK 
{
    UINT16      hTask;          
    SEMAPHORE   Semaphore;      
    void*       pStack;         
    UINT16      bBusy;          
    UINT16      Error;          
    void*       IrqThunk;       
    UINT16      level;          
    UINT16      align;
} TASK, * LPTASK; 
#pragma BYTE_NORMAL()





#pragma BYTE_ALIGN(_DEVICE_IO)  
typedef struct _DEVICE_IO       
{
    void*        pSrc;          
    void*        pDst;          // UIOT offset/pointer for input devices || DPR  offset/pointer for output devices
    UIOTREF2VOID ofsUiot;       // ofsDst for input devices or ofsSrc for output devices
    UINT16       Size;          // device input or output size.  Never 0 !!!
    UINT16       bUsed;         // If no I/O tags defined in the UIOT, skip it
} DEVICE_IO, *LPDEVICE_IO;            
#pragma BYTE_NORMAL()


#pragma BYTE_ALIGN(_DEVICE_INST)         // 1 byte alignment
typedef struct _DEVICE_INST
{
    UIOTREF2VOID ofsName;       // UIOT offset to the device name generated at compile time
    UINT16       Address;       // device's network address
    UINT16       Type;          // DEVICE_1W_INPUT, ... Never 0 !!!
    UINT16       Spare1;	
	UINT16       Spare2;
    UINT16       bPresent;      // if 1 --> device was online when load and go
    char*        pName;         // Usable UIOT pointer to the device name generated at runtime based on ofsName.
	DEVICE_IO	 Input;			// how to handle the input image
	DEVICE_IO	 Output;		// how to handle the output image
	UINT32       Sentinel;
} DEVICE_INST, *LPDEVICE_INST;
#pragma BYTE_NORMAL()




#pragma BYTE_ALIGN(_DRIVER_INST) 
typedef struct _DRIVER_INST 
{
    NETWORK Net;

        // Compile-time Static variables.  This structure maps to UIOT

    UIOTREF2VOID    ofsDeviceList;      // Where the DEVICE_INST list starts.
    UINT32          nDevices;           // how many Devices are in the list
	UINT16			PciIndex;			// 1...max  which board 
	UINT16			PciCount;			// 0...max  how many boards expected in the system. 0--> skip test.
	UINT32          PhyAddr;            // BARx read from the PCI card
    UINT16          NumChannels;        // not used, maybe no.axis
    UINT16          bSimulate;          // =0 --> interface card must be present
    
        // Run-time Dynamic Variables
    LPDEVICE_INST   pDeviceList;        // Where the DEVICE_INST list starts.

	/// TODO if io map exist
    LPDEVICE_IO     pInputList;         // Where in the DEVICE_IO  Input list starts
    LPDEVICE_IO     pOutputList;        // Where in the DEVICE_IO Output list starts

	void* 			pDpr;               // virtual pointer built based on BARx, if supported
    UINT16          bFirstCycle;        // Set by OnLine(), reset by Output(). Read by Input() and Output()
    UINT16          bGoOffLine;         // Tell all the bkg functions to shutdown

    LINKED_LIST     Pend;               // Pointer to the linked list of pending functions
    LINKED_LIST     Done;               // Pointer to the linked list of done  functions

    TASK            BackgroundTask;     // controls for the background task
    TASK            InterruptTask;      // controls for the interrupt task
	UIOTREF2UINT8   ofsConfigFile;      // Where the config file can be found in the UIOT
    UINT32          szConfigFile;       // How many bytes in the config file
	long			ShareMemPool;		// not used
    char            ConfigFile[64];		// 28  File name for the configuration file


    UIOTREF2UINT32  ofsSentinel;        // 0x55667788 - display this value using Soft Scope to check corrct map
    UINT32          Sentinel;           // 0x55667788 - display this value using Soft Scope to check corrct map

} DRIVER_INST, *LPDRIVER_INST;    
#pragma BYTE_NORMAL() 


#pragma BYTE_ALIGN( _SPECIAL_INST_HEADER )      // Must be first block in all paremeter blocks
typedef struct _SPECIAL_INST_HEADER
{       // Compile-time Static variables.  This structure maps to .rcd descrition
                                    // off, sz, ob.sz
    UINT16          FunctionId;     //  0    2   2L   PT_CONST  --> UINT16, _SIZE 2L
    UINT16          Spare;        //  2    2		USUALLY SPARE
    UIOTREF2UINT16  ofsStatus;      //  4    4   2L   PT_REF    --> tag's offset in the UIOT
    UIOTREF2UINT16  ofsResult;      //  8    4   2L   PT_REF    --> tag's offset in the UIOT
} SPECIAL_INST_HEADER;              //      12 == sizeof( SPECIAL_INST_HEADER )

#pragma BYTE_NORMAL()
/*
    Note: beacuse all functions have an Id field and a return status, we can standardize them 
    at offsets 0 and 4. This is especially helpful when using customized parameter structures 
    to better match function particularities and to save memory. 
*/

/////// DRVF_MOTION def
#pragma BYTE_ALIGN( _SPECIAL_INST_COMMAND ) 
typedef struct _SPECIAL_INST_COMMAND
{       // Compile-time Static variables.  This structure maps to .rcd descrition
                                        // off, sz, ob.sz
    SPECIAL_INST_HEADER Header;         //  0   12        the header must always be first
    UINT16      AxisAddress;        // 12  2   2L   PT_VALUE, PT_DEVICE --> UINT32
    UINT16	    Function;		// 14    2   2L   PT_REF    --> tag's offset in the UIOT
	double		fPos;		
	double      fstVel;
	double      fmaxVel;
	double      fTAcc;
	double      fTDec;
	double      fSVAcc;
	double      fSVDec;

	double      fPosX;
	double      fPosY;
	double      fPosZ;
	double      fPosU;

	double      fCx;
	double      fCy;
	double      fEx;
	double      fEy;
	double      fOrg;
	PTBUFFER	AxisArray;
	SINT16		OptDir;
	SINT16		Spare;

	
} SPECIAL_INST_COMMAND;                 //      48 == sizeof( SPECIAL_INST_COMMAND )
#pragma BYTE_NORMAL()


/// DRVF_MOTION_INT/F64
#pragma BYTE_ALIGN( _SPECIAL_INST_OTHERS ) 
typedef struct _SPECIAL_INST_OTHERS
{       // Compile-time Static variables.  This structure maps to .rcd descrition
                                        // off, sz, ob.sz
    SPECIAL_INST_HEADER Header;         //  0   12        the header must always be first
    UINT16      AxisAddress;        // 12   2   2L   PT_VALUE, PT_DEVICE --> UINT32
    UINT16	    Function;		// 14   2   2L   PT_REF    --> tag's offset in the UIOT
UIOTREF2SINT16	iGetValue;			//16
	SINT16		iSetValue1;			//20
	SINT16		iSetValue2;			//22
	SINT16		iSetValue3;			//24
	SINT16		iSetValue4;			//26
	SINT16		iSetValue5;			//28
	SINT16		spare;			//		30

	double		fSetValue1;			//32
	double		fSetValue2;			//
	double		fSetValue3;			//
	double		fSetValue4;			//
	double		fSetValue5;			//
UIOTREF2DOUBLE  fGetValue;			//
	SINT16		spare2;			//		30


} SPECIAL_INST_OTHERS;                 //   76
#pragma BYTE_NORMAL()


#pragma BYTE_ALIGN( _SPECIAL_INST_SETGET ) 
typedef struct _SPECIAL_INST_SETGET
{       // Compile-time Static variables.  This structure maps to .rcd descrition
                                        // off, sz, ob.sz
    SPECIAL_INST_HEADER Header;         //  0   12        the header must always be first
    UINT16      AxisAddress;			// 72   2   2L   PT_VALUE, PT_DEVICE --> UINT32
    UINT16	    Function;				// 74    2   2L   PT_REF    --> tag's offset in the UIOT
	SINT32				ArraySize;		// 16	 4
    double				SetSingleValue;		// 20    8  
	PTBUFFER      SetValue;	// 24
	PTBUFFER      GetValue;	// 32

} SPECIAL_INST_SETGET;                  //     152 == sizeof( SPECIAL_INST_COMMAND )
#pragma BYTE_NORMAL()


typedef union _SPECIAL_INST_PARAM
{       // Compile-time Static variables.  This structure maps to .rcd descrition
                                         // off, sz
    SPECIAL_INST_HEADER  paramHeader;   //  0   12
    SPECIAL_INST_COMMAND paramCommand;  //  0   48
	SPECIAL_INST_SETGET  paramSetGet;
	SPECIAL_INST_OTHERS  paramOthers;

} SPECIAL_INST_PARAM;                   //      48 == sizeof(SPECIAL_INST_PARAM)

typedef struct _SPECIAL_INST
{       // Compile-time Static variables.  This structure maps to .rcd descrition
                                        // off,  sz
    SPECIAL_INST_PARAM  User;           //   0   48
    SPECIAL_INST_PARAM  Work;           //  48   48
        // generic, same for all drivers having asyncronous special functions
    UINT32                MarkTime;     //  96    4  when this s.f. must be complete
